num1, num2 = int(input()), int(input())
# ИСПРАВИТЬ: этот способ не сработает, если пользователю потребуется ввести дробную часть для числа с количеством десятичных знаков больше одного (см. тест ниже) — придумайте более универсальное решение
num = num1 + num2 / 10
# КОММЕНТАРИЙ: если результат округления должен быть использован где-то ещё, тогда используете функцию round(); в данном случае выгоднее воспользоваться синтаксисом f-строк
print(f"{num} миль = {round(num * 1.61, 1)} км")


#15.7 миль = 25.3 км

# 5
# 81
# 13.1 миль = 21.1 км
# КОММЕНТАРИЙ: должно быть 
# 5.81 миль = 9.4 км


# ИТОГ: доработать — 2/5

