from typing import Generator
def deck() -> Generator[tuple, None, None]:
    """
    Генераторная функция, которая создаёт упорядоченную колоду карт.
    Колода упорядочивается следующим образом: 
    сначала все номиналы червей, затем все номиналы бубен, затем все номиналы пик и в конце все номиналы треф.
    """
    
    a = [2, 3, 4, 5, 6, 7, 8, 9, 10, 'валет', 'дама', 'король', 'туз']
    b = ['черви', 'бубны', 'пики', 'трефы']
    for y in b:
        for x in a:
            yield (x, y)


#>>> (list(deck())[::13])
#[(2, 'черви'), (2, 'бубны'), (2, 'пики'), (2, 'трефы')]
