from utils import important_message, choice_data

def main() -> None:
    """ Запрашивает текcт от пользователя и,
        с помощью функции important_message() из модуля utils, выводит его"""

    message = "ИСТОРИЧЕСКАЯ БЛИЦ-ВИКТОРИНА "

    print(important_message(message))
    print('\nПриветствуем в викторине по истории!')
    print('Проверьте своё знание истории России с помощью интересных вопросов.')
    print('\nВсе вопросы имеют варианты ответов, среди них только один верный. За отведённое время (20 с) вам необходимо ввести номер варианта после приглашения для ввода и нажать клавишу Enter.\n')

    print(f'Ваш счет: {choice_data()}')

main()



#Для игр с футболистами какой страны была в 1923 году впервые создана сборная РСФСР по футболу?
#
#1. Швеция
#2. Финляндия
#3. Германия
#4. Великобритания
# > j
#!  введите цифру номера ответа !
# > 56
#!  введите цифру номера ответа !
# > 3
#Неверно...
#
#
#Кто в 1964 году основал первый в мире музыкальный театр для детей?
#
#1. Станиславский и Немирович-Данченко
#2. Юрий Куклачёв
#3. Сергей Образцов
#4. Наталья Сац
# > 2
#Неверно...
#
#
#Что получает россиянин, когда впервые устраивается на работу?
#
#1. Трудовое знамя
#2. Трудовой орден
#3. Трудовую книжку
#4. Трудовую зачётку
# > 4
#Неверно...
#
#
#В каком городе в XI веке впервые на Руси появились колокола?
#
#1. В Рязани
#2. Гимназия
#3. Иване Грозном была основана первая в России:
#4. В Новгороде
#5. Типография
#6. Университет
#7. Корабельная верфь
#8. В Москве
#9. В Астрахани
# > 9
#Неверно...
#
#
#Какой из этих пассажирских самолётов был первым в СССР реактивным авиалайнером?
#
#1. Ил-62
#2. Ан-24
#3. Як-40
#4. Ту-104
# > 5
#!  введите цифру номера ответа !
# > 4
#Верно! 0.9 с
#
#
#Ваш счет: 20
#>>>