import ref7

for elem in ref7.list_of_dicts:
    f_d = {}
    for d in (ref7.list_of_dicts):
        for key, value in d.items():
            f_d.setdefault((key), set()).add(value)
            
print('\n'.join([f"'{key}' : {value}" for key, value in f_d.items()]))

#'Владивосток' : {5}
#'Воронеж' : {1, 4}
#'Екатеринбург' : {1, 3, 5}
#'Иркутск' : {9, 2, 5}
#'Москва' : {3, 4, 6}
#'Новокузнецк' : {2, 4}
#'Оренбург' : {1}
#'Саратов' : {2}
#'Уфа' : {9}
#'Ярославль' : {8, 7}
#'Волгоград' : {5}
#'Нижний Новгород' : {8, 2, 5}
#'Ростов-на-Дону' : {6}
#'Тольятти' : {1}
#'Тюмень' : {3}
#'Казань' : {4}
#'Новосибирск' : {7}
#'Пермь' : {3}
#'Челябинск' : {3}
#'Санкт-Петербург' : {7}