def int_base(num: str, bs1: int, bs2: int) -> str|None:
    """
    Функция, преобразовывающая число из произвольной системы счисления в произвольную.
    Функция возвращает строковое представление числа в целевой системе счисления или None в случае возникновения ошибок.
    
        Ошибки могут возникать в следующих случаях:
            - исходное или целевое основание системы счисления находится за пределами обозначенного выше диапазона
            - строковое представление числа не соответствует заявленной исходной системе счисления
    """   
    if 2 < bs2 > 36 or 2 < bs1 > 36:
        return None
    try:
        num_bs1 = int(num, bs1)
    except ValueError:
        return None
    ds = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ"    
    res = ''
    while num_bs1 > 0:
        digit = num_bs1 % bs2
        res = ds[digit] + res
        num_bs1 //= bs2
        
    return res
        
    
int_base()

#>>> int_base('ff00', 16, 2)
#'1111111100000000'
#>>> int_base('1101010', 2, 30)
#'3G'